keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSent_reg.h
/** \\brief  41C, Receive Data View Register */
#define SENT_CH12_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000341Cu)

/** Alias (User Manual Name) for SENT_CH12_VIEW.
* To use register names with standard convension, please use SENT_CH12_VIEW.
*/
#define	SENT_VIEW12	(SENT_CH12_VIEW)

/** \\brief  434, Watch Dog Timer Register */
#define SENT_CH12_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003434u)

/** Alias (User Manual Name) for SENT_CH12_WDT.
* To use register names with standard convension, please use SENT_CH12_WDT.
*/
#define	SENT_WDT12	(SENT_CH12_WDT)

/** \\brief  444, Channel Fractional Divider Register */
#define SENT_CH13_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003444u)

/** Alias (User Manual Name) for SENT_CH13_CFDR.
* To use register names with standard convension, please use SENT_CH13_CFDR.
*/
#define	SENT_CFDR13	(SENT_CH13_CFDR)

/** \\brief  440, Channel Pre Divider Register */
#define SENT_CH13_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003440u)

/** Alias (User Manual Name) for SENT_CH13_CPDR.
* To use register names with standard convension, please use SENT_CH13_CPDR.
*/
#define	SENT_CPDR13	(SENT_CH13_CPDR)

/** \\brief  470, Interrupt Node Pointer Register */
#define SENT_CH13_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003470u)

/** Alias (User Manual Name) for SENT_CH13_INP.
* To use register names with standard convension, please use SENT_CH13_INP.
*/
#define	SENT_INP13	(SENT_CH13_INP)

/** \\brief  468, Interrupt Clear Register */
#define SENT_CH13_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003468u)

/** Alias (User Manual Name) for SENT_CH13_INTCLR.
* To use register names with standard convension, please use SENT_CH13_INTCLR.
*/
#define	SENT_INTCLR13	(SENT_CH13_INTCLR)

/** \\brief  46C, Interrupt Enable Register */
#define SENT_CH13_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000346Cu)

/** Alias (User Manual Name) for SENT_CH13_INTEN.
* To use register names with standard convension, please use SENT_CH13_INTEN.
*/
#define	SENT_INTEN13	(SENT_CH13_INTEN)

/** \\brief  464, Interrupt Set Register */
#define SENT_CH13_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003464u)

/** Alias (User Manual Name) for SENT_CH13_INTSET.
* To use register names with standard convension, please use SENT_CH13_INTSET.
*/
#define	SENT_INTSET13	(SENT_CH13_INTSET)

/** \\brief  460, Interrupt Status Register */
#define SENT_CH13_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003460u)

/** Alias (User Manual Name) for SENT_CH13_INTSTAT.
* To use register names with standard convension, please use SENT_CH13_INTSTAT.
*/
#define	SENT_INTSTAT13	(SENT_CH13_INTSTAT)

/** \\brief  454, Input and Output Control Register */
#define SENT_CH13_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003454u)

/** Alias (User Manual Name) for SENT_CH13_IOCR.
* To use register names with standard convension, please use SENT_CH13_IOCR.
*/
#define	SENT_IOCR13	(SENT_CH13_IOCR)

/** \\brief  448, Receiver Control Register */
#define SENT_CH13_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003448u)

/** Alias (User Manual Name) for SENT_CH13_RCR.
* To use register names with standard convension, please use SENT_CH13_RCR.
*/
#define	SENT_RCR13	(SENT_CH13_RCR)

/** \\brief  44C, Receive Status Register */
#define SENT_CH13_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000344Cu)

/** Alias (User Manual Name) for SENT_CH13_RSR.
* To use register names with standard convension, please use SENT_CH13_RSR.
*/
#define	SENT_RSR13	(SENT_CH13_RSR)

/** \\brief  458, SPC Control Register */
#define SENT_CH13_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003458u)

/** Alias (User Manual Name) for SENT_CH13_SCR.
* To use register names with standard convension, please use SENT_CH13_SCR.
*/
#define	SENT_SCR13	(SENT_CH13_SCR)

/** \\brief  450, Serial Data and Status Register */
#define SENT_CH13_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003450u)

/** Alias (User Manual Name) for SENT_CH13_SDS.
* To use register names with standard convension, please use SENT_CH13_SDS.
*/
#define	SENT_SDS13	(SENT_CH13_SDS)

/** \\brief  45C, Receive Data View Register */
#define SENT_CH13_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000345Cu)

/** Alias (User Manual Name) for SENT_CH13_VIEW.
* To use register names with standard convension, please use SENT_CH13_VIEW.
*/
#define	SENT_VIEW13	(SENT_CH13_VIEW)

/** \\brief  474, Watch Dog Timer Register */
#define SENT_CH13_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003474u)

/** Alias (User Manual Name) for SENT_CH13_WDT.
* To use register names with standard convension, please use SENT_CH13_WDT.
*/
#define	SENT_WDT13	(SENT_CH13_WDT)

/** \\brief  484, Channel Fractional Divider Register */
#define SENT_CH14_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003484u)

/** Alias (User Manual Name) for SENT_CH14_CFDR.
* To use register names with standard convension, please use SENT_CH14_CFDR.
*/
#define	SENT_CFDR14	(SENT_CH14_CFDR)

/** \\brief  480, Channel Pre Divider Register */
#define SENT_CH14_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003480u)

/** Alias (User Manual Name) for SENT_CH14_CPDR.
* To use register names with standard convension, please use SENT_CH14_CPDR.
*/
#define	SENT_CPDR14	(SENT_CH14_CPDR)

/** \\brief  4B0, Interrupt Node Pointer Register */
#define SENT_CH14_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00034B0u)

/** Alias (User Manual Name) for SENT_CH14_INP.
* To use register names with standard convension, please use SENT_CH14_INP.
*/
#define	SENT_INP14	(SENT_CH14_INP)

/** \\brief  4A8, Interrupt Clear Register */
#define SENT_CH14_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00034A8u)

/** Alias (User Manual Name) for SENT_CH14_INTCLR.
* To use register names with standard convension, please use SENT_CH14_INTCLR.
*/
#define	SENT_INTCLR14	(SENT_CH14_INTCLR)

